<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<!-- HTML dokument hentet fra Knut Collin ved Høgskolen i Narvik, Itslearning Oblig3 -->
<html>
  <head>
    <meta content="text/html; charset=us-ascii" http-equiv=
    "content-type">
    <link rel="STYLESHEET" type="text/css" href=
    "http://kark.hin.no/css/kursweb.css">
    <title>
      Oblig 2 Internett teknologi
    </title>
    <style type="text/css">
<!--
    .style1 {font-family: "Courier New", Courier, monospace}
    -->
    </style>
  </head>
  <body class="hoved">
    <h1>
      ITE 1720 Databaser og webapplikasjoner
    </h1>
    <h2>
      Obligatorisk oppgave 3 v&aring;ren 2012 - Presentasjon og
      blogg
    </h2>
    <p>
      Du skal i denne oppgaven starte utviklingen av en personlig
      blogg. Bloggen skal videreutvukles i neste innlevering slik
      at du ved kursets slutt skal ha en noenlunde komplett
      egenutviklet blogg. L&oslash;sningen skal baseres p&aring;
      bruk av XHTML/HTML, stilark, JavaScript, Ajax, XML og PHP.
      Bloggen skal etterhvert benytte en database for lagring av
      informasjon, men i denne f&oslash;rste innleveringen skal
      bloggen lagres p&aring; XML format i filsystemet. Bloggen
      er en del av et webomr&aring;de der du presenterer deg
      selv.
    </p>
    <p>
      Oppgave:
    </p>
    <ol>
      <li>Lag en startside for presentasjon av deg selv, du
      velger selv om denne er statisk eller om det er PHP som
      genererer hele eller deler av denne, siden skal inneholde
      litt informasjon om deg selv og et bilde.
      </li>
      <li>Lag et web basert blog med en hovedside som viser alle,
      evt. et utvalg av alle, innlegg sortert p&aring; dato.
      Innlegg b&oslash;r ogs&aring; kunne sorteres basert
      p&aring; stikkord (tags).
      </li>
      <li>Eieren av bloggen skal m&aring;tte logge seg p&aring;
      for &aring; legge inn nye innlegg.
      </li>
      <li>Anonyme brukere skal kunne lese alle innlegg
      </li>
      <li>Bloggen lagres i filsystemet i XML format, benytt PHP
      og SimpleXML, skriv gjerne en egen dataksess klasse der du
      benytter SimpleXML i denne oppgaven, klassen kan senere
      utvides for &aring; st&oslash;tte lagring i database
      </li>
      <li>Smarty templates benyttes for &aring; skille HTML og
      PHP kode
      </li>
      <li>Benytt objektorienterte prinsipper ved PHP kodingen.
      </li>
      <li>Du bestemmer selv formatet for et blogg innlegg i XML,
      hvilke elementer som skal v&aelig;re med. Naturlige
      elementer kan v&aelig;re Tittel, tekst for innlegget, dato,
      forfatter, stikkord (tags)
      </li>
      <li>Alle dokumentene skal benytte det samme stilarket slik
      at stil/utseende blir ensartet. Tabeller skal ikke
      benyttess for layout, JavaScript og AJAX benyttes etter
      behov
      </li>
      <li>Valider dokumenter og stilark hos <a href=
      "http://www.w3c.org/">http://www.w3c.org/.</a>
      </li>
    </ol>
    <h4>
      HTML5 &amp; CSS3
    </h4>
    <p>
      L&oslash;sningen b&oslash;r bruke noe av nye elementer
      &amp; egenskaper til HTML5 og CSS3, du velger selv, men
      sjekk dette ut i de vanligste nettleserne, dersom noen av
      den funksjonaliteten du benytter kun virker i en spesifikk
      nettleser s&aring; m&aring; du opplyse om dette.
    </p>
    <p>
      <strong>Generelle krav til l&oslash;sningen.<br></strong>
      Bruk bare relative URL'er i lenkene, og legg alle filer i
      samme mappe. Dette betyr at det kun blir filnavn i lenkene.
      Dette gj&oslash;r at webomr&aring;det med alle filene er
      lett flyttbar. Eventuelle bilder legges ogs&aring; i samme
      mappe, evt. en undermappe. Unng&aring; norske tegn
      (&aelig;&oslash;&aring;) og blanke tegn (mellomrom) i
      filnavn da dette ofte skaper problemer for ulike
      nettlesere.
    </p>
    <p>
      All input fra brukere m&aring; vaskes f&oslash;r lagring
      p&aring; XML format, benytt <a href=
      "http://no.php.net/manual/en/function.strip-tags.php"><span class="courierbold">
      strip_tags()</span></a> eller <a href=
      "http://no.php.net/manual/en/function.htmlentities.php"><span class="courierbold">
      html_entities()</span></a> for dette. Benytt utf8 metodene
      <a href=
      "http://no.php.net/manual/en/function.utf8-encode.php"><span class="courierbold">
      utf8_encode()</span></a> og <span class=
      "courierbold">utf8_decode()</span> ved skriving og lesing
      av XML filen i utf-8 format.
    </p>
    <p>
      <strong>NB !</strong> All kode som benyttes skal v&aelig;re
      egenprodusert. I de tilfellene der det benyttes kode
      skrevet av andre skal dette opplyses. Kildehenvisninger er
      meget viktig.
    </p>
    <p>
      <strong>Publisering.<br></strong>Endelig l&oslash;sning
      publiseres under eget omr&aring;de p&aring; kark.hin.no.
    </p>
    <h3>
      Innlevering
    </h3>
    <p>
      All kildekode leveres elektronisk p&aring; It's learning
      som en ZIP/TAR fil eller liknende.. L&oslash;sningen
      m&aring; v&aelig;re kj&oslash;rbar p&aring; webtjener, slik
      at det er lett for fagl&aelig;rer/sensor &aring; vurdere
      l&oslash;sningen. Det er derfor s&aelig;rdeles viktig at
      URL adresser og n&oslash;dvendige brukernavn og passord er
      lett tilgjengelige. ZIP filen skal inneholde en fil med
      navn README.TXT der alle n&oslash;dvendige URL adresser og
      brukernavn og passord ligger.
    </p>
  </body>
</html>
